experiment-data/MicroShift/dp_redis_density/dp_redis_density/2022-10-11T10-39-06/kbench-pod-oid-0-tid-1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1667.37          ---          ---        10.88035         5.88700        82.94300       172.03100       128.45 
Gets        16671.99         3.59     16668.40        10.88678         5.88700        83.45500       173.05500       649.54 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      18339.36         3.59     16668.40        10.88620         5.88700        83.45500       173.05500       777.98 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.215        0.000
SET       1.207        5.000
SET       1.551       10.000
SET       1.959       15.000
SET       2.575       20.000
SET       3.087       25.000
SET       3.599       30.000
SET       4.159       35.000
SET       4.703       40.000
SET       5.247       45.000
SET       5.887       50.000
SET       6.239       52.500
SET       6.623       55.000
SET       7.007       57.500
SET       7.455       60.000
SET       7.999       62.500
SET       8.575       65.000
SET       9.279       67.500
SET      10.111       70.000
SET      11.007       72.500
SET      12.095       75.000
SET      12.735       76.250
SET      13.375       77.500
SET      14.015       78.750
SET      14.783       80.000
SET      15.551       81.250
SET      16.383       82.500
SET      17.407       83.750
SET      18.303       85.000
SET      19.455       86.250
SET      20.863       87.500
SET      21.503       88.125
SET      22.271       88.750
SET      23.167       89.375
SET      24.063       90.000
SET      25.087       90.625
SET      26.111       91.250
SET      27.391       91.875
SET      28.671       92.500
SET      30.207       93.125
SET      31.871       93.750
SET      32.767       94.062
SET      33.791       94.375
SET      34.815       94.688
SET      36.095       95.000
SET      37.375       95.312
SET      38.911       95.625
SET      40.447       95.938
SET      42.239       96.250
SET      44.287       96.562
SET      46.335       96.875
SET      47.615       97.031
SET      49.151       97.188
SET      50.431       97.344
SET      52.223       97.500
SET      54.015       97.656
SET      56.063       97.812
SET      58.367       97.969
SET      60.927       98.125
SET      63.999       98.281
SET      67.583       98.438
SET      69.119       98.516
SET      71.167       98.594
SET      73.215       98.672
SET      75.263       98.750
SET      77.311       98.828
SET      79.871       98.906
SET      82.431       98.984
SET      85.503       99.062
SET      88.575       99.141
SET      92.671       99.219
SET      94.207       99.258
SET      95.743       99.297
SET      97.791       99.336
SET      99.839       99.375
SET     102.399       99.414
SET     104.447       99.453
SET     107.519       99.492
SET     111.615       99.531
SET     115.711       99.570
SET     119.807       99.609
SET     122.367       99.629
SET     124.415       99.648
SET     125.951       99.668
SET     128.511       99.688
SET     130.559       99.707
SET     133.119       99.727
SET     135.167       99.746
SET     138.239       99.766
SET     142.335       99.785
SET     145.407       99.805
SET     148.479       99.814
SET     150.527       99.824
SET     153.599       99.834
SET     155.647       99.844
SET     158.719       99.854
SET     160.767       99.863
SET     163.839       99.873
SET     166.911       99.883
SET     168.959       99.893
SET     173.055       99.902
SET     176.127       99.907
SET     178.175       99.912
SET     181.247       99.917
SET     184.319       99.922
SET     187.391       99.927
SET     190.463       99.932
SET     192.511       99.937
SET     195.583       99.941
SET     199.679       99.946
SET     201.727       99.951
SET     204.799       99.954
SET     207.871       99.956
SET     209.919       99.958
SET     211.967       99.961
SET     214.015       99.963
SET     217.087       99.966
SET     222.207       99.968
SET     226.303       99.971
SET     229.375       99.973
SET     233.471       99.976
SET     237.567       99.977
SET     239.615       99.978
SET     241.663       99.979
SET     246.783       99.980
SET     248.831       99.982
SET     253.951       99.983
SET     258.047       99.984
SET     264.191       99.985
SET     266.239       99.987
SET     272.383       99.988
SET     276.479       99.988
SET     280.575       99.989
SET     282.623       99.990
SET     284.671       99.990
SET     286.719       99.991
SET     286.719       99.991
SET     292.863       99.992
SET     294.911       99.993
SET     296.959       99.993
SET     299.007       99.994
SET     299.007       99.994
SET     305.151       99.995
SET     305.151       99.995
SET     307.199       99.995
SET     313.343       99.995
SET     315.391       99.996
SET     317.439       99.996
SET     333.823       99.996
SET     337.919       99.997
SET     337.919       99.997
SET     339.967       99.997
SET     344.063       99.997
SET     346.111       99.997
SET     346.111       99.998
SET     356.351       99.998
SET     356.351       99.998
SET     356.351       99.998
SET     358.399       99.998
SET     385.023       99.998
SET     401.407       99.998
SET     403.455       99.999
SET     450.559       99.999
SET     452.607       99.999
SET     452.607       99.999
SET     452.607       99.999
SET     464.895       99.999
SET     464.895       99.999
SET     464.895       99.999
[...]
SET     483.327       99.999
SET     483.327       99.999
SET     493.567      100.000
SET     493.567      100.000
SET     493.567      100.000
SET     495.615      100.000
SET     495.615      100.000
SET     495.615      100.000
[...]
SET     509.951      100.000
SET     509.951      100.000
SET     509.951      100.000
[...]
SET     514.047      100.000
SET     514.047      100.000
SET     514.047      100.000
[...]
SET     516.095      100.000
SET     516.095      100.000
---
GET       0.183        0.000
GET       1.207        5.000
GET       1.551       10.000
GET       1.959       15.000
GET       2.575       20.000
GET       3.087       25.000
GET       3.599       30.000
GET       4.159       35.000
GET       4.703       40.000
GET       5.247       45.000
GET       5.887       50.000
GET       6.239       52.500
GET       6.623       55.000
GET       7.007       57.500
GET       7.455       60.000
GET       7.999       62.500
GET       8.575       65.000
GET       9.279       67.500
GET      10.111       70.000
GET      11.007       72.500
GET      12.159       75.000
GET      12.735       76.250
GET      13.375       77.500
GET      14.015       78.750
GET      14.783       80.000
GET      15.551       81.250
GET      16.511       82.500
GET      17.407       83.750
GET      18.431       85.000
GET      19.583       86.250
GET      20.863       87.500
GET      21.503       88.125
GET      22.271       88.750
GET      23.167       89.375
GET      24.063       90.000
GET      25.087       90.625
GET      26.111       91.250
GET      27.391       91.875
GET      28.671       92.500
GET      30.207       93.125
GET      31.871       93.750
GET      32.767       94.062
GET      33.791       94.375
GET      34.815       94.688
GET      36.095       95.000
GET      37.375       95.312
GET      38.911       95.625
GET      40.447       95.938
GET      42.239       96.250
GET      44.287       96.562
GET      46.335       96.875
GET      47.615       97.031
GET      49.151       97.188
GET      50.431       97.344
GET      52.223       97.500
GET      54.015       97.656
GET      56.063       97.812
GET      58.367       97.969
GET      60.927       98.125
GET      63.999       98.281
GET      67.583       98.438
GET      69.119       98.516
GET      71.167       98.594
GET      73.215       98.672
GET      75.263       98.750
GET      77.823       98.828
GET      80.383       98.906
GET      82.943       98.984
GET      85.503       99.062
GET      88.575       99.141
GET      92.159       99.219
GET      94.207       99.258
GET      95.743       99.297
GET      97.791       99.336
GET      99.839       99.375
GET     102.399       99.414
GET     104.959       99.453
GET     107.519       99.492
GET     111.615       99.531
GET     115.199       99.570
GET     119.295       99.609
GET     121.343       99.629
GET     123.903       99.648
GET     125.439       99.668
GET     127.487       99.688
GET     130.047       99.707
GET     133.119       99.727
GET     135.167       99.746
GET     138.239       99.766
GET     141.311       99.785
GET     145.407       99.805
GET     148.479       99.814
GET     150.527       99.824
GET     152.575       99.834
GET     155.647       99.844
GET     157.695       99.854
GET     160.767       99.863
GET     163.839       99.873
GET     166.911       99.883
GET     169.983       99.893
GET     175.103       99.902
GET     177.151       99.907
GET     179.199       99.912
GET     182.271       99.917
GET     184.319       99.922
GET     188.415       99.927
GET     191.487       99.932
GET     193.535       99.937
GET     196.607       99.941
GET     200.703       99.946
GET     203.775       99.951
GET     206.847       99.954
GET     208.895       99.956
GET     209.919       99.958
GET     212.991       99.961
GET     217.087       99.963
GET     222.207       99.966
GET     225.279       99.968
GET     228.351       99.971
GET     232.447       99.973
GET     238.591       99.976
GET     241.663       99.977
GET     243.711       99.978
GET     246.783       99.979
GET     249.855       99.980
GET     252.927       99.982
GET     254.975       99.983
GET     259.071       99.984
GET     264.191       99.985
GET     272.383       99.987
GET     278.527       99.988
GET     282.623       99.988
GET     284.671       99.989
GET     286.719       99.990
GET     290.815       99.990
GET     294.911       99.991
GET     296.959       99.991
GET     299.007       99.992
GET     303.103       99.993
GET     307.199       99.993
GET     311.295       99.994
GET     315.391       99.994
GET     315.391       99.995
GET     319.487       99.995
GET     325.631       99.995
GET     333.823       99.995
GET     337.919       99.996
GET     339.967       99.996
GET     344.063       99.996
GET     346.111       99.997
GET     348.159       99.997
GET     356.351       99.997
GET     356.351       99.997
GET     356.351       99.997
GET     356.351       99.998
GET     358.399       99.998
GET     380.927       99.998
GET     395.263       99.998
GET     450.559       99.998
GET     452.607       99.998
GET     452.607       99.998
GET     452.607       99.999
GET     452.607       99.999
GET     454.655       99.999
GET     458.751       99.999
GET     464.895       99.999
GET     464.895       99.999
GET     464.895       99.999
[...]
GET     483.327       99.999
GET     483.327       99.999
GET     483.327       99.999
GET     489.471       99.999
GET     491.519       99.999
GET     493.567       99.999
GET     495.615      100.000
GET     497.663      100.000
GET     507.903      100.000
GET     509.951      100.000
GET     509.951      100.000
GET     509.951      100.000
GET     511.999      100.000
GET     511.999      100.000
GET     514.047      100.000
GET     514.047      100.000
GET     516.095      100.000
GET     516.095      100.000
GET     516.095      100.000
GET     518.143      100.000
GET     518.143      100.000
GET     518.143      100.000
[...]
GET     581.631      100.000
GET     581.631      100.000
GET     585.727      100.000
GET     585.727      100.000
---
WAIT      0.000      100.000